Config/InformationRegisters/НастройкиВнутреннегоЭДОБГУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиВнутреннегоЭДОБГУ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Формировать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаршрутПодписания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаршрутыПодписанияБГУ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнаяПечатнаяФорма</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторКомандыПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/НастройкиВнутреннегоЭДОБГУ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";
	
	Ограничение.ТекстДляВнешнихПользователей =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

Функция ТекущаяНастройкаВнутреннегоЭДОБГУ(Организация = Неопределено) Экспорт
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиВнутреннегоЭДОБГУ.ИдентификаторДокумента КАК ИдентификаторДокумента,
	|	НастройкиВнутреннегоЭДОБГУ.ИдентификаторКомандыПечати КАК ИдентификаторКомандыПечати,
	|	НастройкиВнутреннегоЭДОБГУ.Формировать КАК Формировать,
	|	НастройкиВнутреннегоЭДОБГУ.МаршрутПодписания КАК МаршрутПодписания,
	|	НастройкиВнутреннегоЭДОБГУ.ОсновнаяПечатнаяФорма КАК ОсновнаяПечатнаяФорма
	|ИЗ
	|	РегистрСведений.НастройкиВнутреннегоЭДОБГУ КАК НастройкиВнутреннегоЭДОБГУ
	|ГДЕ
	|	НастройкиВнутреннегоЭДОБГУ.Организация = &Организация
	|ИТОГИ ПО
	|	ИдентификаторДокумента";
	
	Если Организация = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "НастройкиВнутреннегоЭДОБГУ.Организация = &Организация", "ИСТИНА");
	Иначе
		Запрос.УстановитьПараметр("Организация", Организация);
	КонецЕсли;
	
	ВыборкаПоДокументам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоДокументам.Следующий() Цикл
		ПечатныеФормы = Новый Соответствие;
		ВыборкаПоФормам = ВыборкаПоДокументам.Выбрать();
		Пока ВыборкаПоФормам.Следующий() Цикл
			ПечатныеФормы.Вставить(ВыборкаПоФормам.ИдентификаторКомандыПечати,
				Новый Структура("Формировать, МаршрутПодписания, ОсновнаяПечатнаяФорма",
					ВыборкаПоФормам.Формировать,
					ВыборкаПоФормам.МаршрутПодписания,
					ВыборкаПоФормам.ОсновнаяПечатнаяФорма));
		КонецЦикла;
		Результат.Вставить(ВыборкаПоДокументам.ИдентификаторДокумента, ПечатныеФормы);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Получает маршрут подписания по переданным параметрам
//
// Параметры:
//  Организация - СправочникСсылка.Организации 
//  УчетныйДокумент - ОпределяемыйТип.ОснованиеВнутреннегоЭлектронногоДокумента - ссылка на учетный документ
//  ИдентификаторКомандыПечати - Строка
//
// Возвращаемое знаение:
//  - СправочникСсылка.МаршрутыПодписанияБГУ - маршрут подписания
Функция МаршрутИзНастройкиВнутреннегоЭДОБГУ(Организация, УчетныйДокумент, ИдентификаторКомандыПечати) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиВнутреннегоЭДОБГУ.МаршрутПодписания КАК МаршрутПодписания
	|ИЗ
	|	РегистрСведений.НастройкиВнутреннегоЭДОБГУ КАК НастройкиВнутреннегоЭДОБГУ
	|ГДЕ
	|	НастройкиВнутреннегоЭДОБГУ.Организация = &Организация
	|	И НастройкиВнутреннегоЭДОБГУ.ИдентификаторДокумента = &ИдентификаторДокумента
	|	И НастройкиВнутреннегоЭДОБГУ.ИдентификаторКомандыПечати = &ИдентификаторКомандыПечати
	|	И НастройкиВнутреннегоЭДОБГУ.Формировать";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ИдентификаторДокумента",
		ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(УчетныйДокумент)));
	Запрос.УстановитьПараметр("ИдентификаторКомандыПечати", ИдентификаторКомандыПечати);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Маршрут = Справочники.МаршрутыПодписанияБГУ.ПустаяСсылка();
	Если Выборка.Следующий() Тогда
		Маршрут = Выборка.МаршрутПодписания;
	КонецЕсли;
	
	Возврат Маршрут;
КонецФункции	

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	ВнутреннийЭДОПереопределяемый.ОбработкаПолученияФормыСпискаНастроек(
		ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
